[
    {
        "id": 1,
        "author": "Sofia Ribeiro",
        "channel": "#informática",
        "likes": 12,
        "liked": false,
        "message": "Pessoal, acabei de ler um artigo super legal sobre como as linguagens de programação estão mudando! \nÉ incrível ver como linguagens como Python, que a gente começa a aprender, estão sendo usadas pra tanta coisa, desde criar páginas na internet até em projetos de inteligência artificial, tipo aquelas que vemos em jogos ou quando um site recomenda algo pra gente.\nO artigo até falou um pouco sobre o futuro, com computadores super diferentes, mas isso é mais pra frente né? rsrs\nQuem mais aí tá aprendendo alguma linguagem nova nas aulas ou viu algo interessante sobre o mundo da programação ultimamente e quer compartilhar?"
    },
    {
        "id": 2,
        "author": "Mateus Azevedo",
        "channel": "#mecânica",
        "likes": 25,
        "liked": false,
        "message": "E aí, galera da mecânica! Estou começando um projeto para tentar entender melhor o sistema de arrefecimento de um motor pequeno, tipo aqueles que a gente estuda na oficina.\nEstou pesquisando como o calor se espalha pelas peças e como o design do radiador e o tipo de líquido que a gente usa (água com aditivo, por exemplo) podem fazer o motor funcionar direitinho e não esquentar demais.\nPenso em usar alguns exemplos práticos e talvez alguns vídeos para visualizar como a temperatura se comporta.\nAlguém já mexeu com a manutenção de radiadores ou tem alguma dica de material legal pra estudar sobre troca de calor em motores de um jeito mais simples?\nDepois conto o que aprendi!"
    },
    {
        "id": 3,
        "author": "Clara Nogueira",
        "channel": "#química",
        "likes": 8,
        "liked": false,
        "message": "Oi, pessoal de química! Estou com uma dúvida numa experiência sobre a velocidade de uma reação que a gente fez no laboratório, aquela que a gente misturou dois líquidos e mudou de cor.\nQueria entender melhor o que faz ela acontecer mais rápido ou mais devagar, por exemplo, se a gente esquentar um pouco ou se misturar com mais força.\nAlguém tem alguma dica de site ou vídeo que explique de um jeito fácil essa parte de cinética química, mostrando como a temperatura e a concentração afetam as reações?\nAgradeço qualquer ajuda para entender melhor os fatores que mudam a velocidade das transformações químicas!"
    },
    {
        "id": 4,
        "author": "Leonardo Barros",
        "channel": "#eletrotécnica",
        "likes": 33,
        "liked": false,
        "message": "Fala, turma da eletro! Queria compartilhar um esquema simples que fiz de uma instalação elétrica de um cômodo, mostrando onde vão os disjuntores, as tomadas e as lâmpadas.\nÉ um exemplo básico pra gente praticar como aplicar as coisas que aprendemos sobre segurança nas instalações e como escolher os fios com a bitola certa para cada parte do circuito, evitando problemas.\nUsei como base as orientações que o professor passou pra gente sobre as normas de segurança.\nEspero que ajude quem tá aprendendo a desenhar esses esquemas também! Se alguém tiver alguma sugestão ou dúvida, pode falar."
    },
    {
        "id": 5,
        "author": "Alice Gomes",
        "channel": "#edificações",
        "likes": 17,
        "liked": false,
        "message": "Oi gente de edificações! Estou pensando em como poderia ser o projeto de um cantinho de estudos bem organizado e confortável, talvez usando materiais que a gente já tem ou que são mais baratos.\nQueria usar umas ideias com prateleiras para organizar os livros e pensar numa iluminação boa para ler e estudar sem cansar a vista, aproveitando a luz natural durante o dia.\nTipo, como usar cores claras nas paredes pra parecer que o espaço é maior e talvez algumas plantas pra deixar o ambiente mais agradável.\nAlguém tem alguma sugestão de como deixar um ambiente pequeno mais funcional e bonito, pensando também em sustentabilidade? Adoraria ouvir as ideias de vocês!"
    },
    {
        "id": 6,
        "author": "Enzo Carvalho",
        "channel": "#telecomunicações",
        "likes": 21,
        "liked": false,
        "message": "E aí, pessoal de telecom! Assisti uma apresentação bem legal sobre como a internet por fibra óptica está ficando cada vez mais rápida e chegando em mais lugares.\nExplicaram de um jeito simples como os cabos de fibra conseguem transmitir tanta informação usando luz e como isso vai ajudar a gente a ter vídeos, jogos online e aulas virtuais com mais qualidade no futuro.\nFiquei pensando em como toda essa tecnologia funciona, desde a nossa casa até os grandes centros de dados das empresas de internet.\nAlguém mais tem curiosidade sobre como a nossa conexão de internet funciona ou quer trocar umas ideias sobre as novidades nessa área?"
    },
    {
        "id": 7,
        "author": "Valentina Moreira",
        "channel": "#informática",
        "likes": 38,
        "liked": false,
        "message": "Oi, galera da informática! Descobri uns truques bem legais no Excel (ou Google Planilhas) que ajudam a analisar dados de tabelas de um jeito bem prático e visual.\nPor exemplo, dá pra criar gráficos de barras ou de pizza para mostrar informações de uma pesquisa que a gente fez na escola, ou para ver as notas da turma de um jeito fácil de entender.\nTambém vi que dá pra usar fórmulas simples para calcular médias e porcentagens rapidinho!\nVou tentar fazer um resuminho com uns exemplos pra gente. Alguém já usou essas ferramentas pra organizar dados ou criar gráficos e tem alguma dica legal?"
    },
    {
        "id": 8,
        "author": "Davi Cunha",
        "channel": "#mecânica",
        "likes": 6,
        "liked": false,
        "message": "Pessoal da mecânica, estou com uma dúvida sobre como as peças de metal que a gente usa nos projetos da oficina aguentam diferentes tipos de força antes de amassar ou quebrar, especialmente nas partes onde tem solda.\nTipo, como a gente pode ter uma ideia se uma emenda soldada num carrinho que fizemos vai ser forte o suficiente para o peso que ele vai carregar?\nAlguém sabe de algum material fácil de entender, tipo vídeos ou apostilas com exemplos, sobre como as forças atuam nos materiais e como a gente pode testar a resistência de uma peça soldada de forma simples?\nQualquer dica de experimento prático ou explicação básica já ajuda bastante!"
    },
    {
        "id": 9,
        "author": "Helena Pinto",
        "channel": "#química",
        "likes": 29,
        "liked": false,
        "message": "Oi, gente! Participei de uma conversa bem interessante sobre 'química verde', que é sobre como podemos fazer nossos experimentos e usar a química de um jeito que não prejudique tanto o meio ambiente.\nFalamos sobre ideias como usar menos produtos que podem ser tóxicos, como podemos reutilizar ou descartar corretamente os materiais do laboratório, e até sobre como algumas reações podem ser feitas com menos gasto de energia.\nFiquei pensando em como a gente pode aplicar essas ideias simples nas nossas aulas práticas para sermos mais sustentáveis.\nAlguém tem alguma sugestão de experimento mais 'verde' que a gente poderia tentar fazer na escola ou ideias para reduzir o desperdício no laboratório? Vamos compartilhar!"
    },
    {
        "id": 10,
        "author": "Bernardo Dias",
        "channel": "#eletrotécnica",
        "likes": 15,
        "liked": false,
        "message": "E aí, turma de eletro! Estou pesquisando sobre como funcionam os painéis solares pequenos e como eles conseguem transformar a luz do sol na eletricidade que a gente usa no dia a dia.\nEstou tentando entender as partes principais de um sistema solar simples, tipo o painel, o controlador de carga e a bateria, e como a gente pode montar um sistema básico, quem sabe pra acender uma lâmpada LED ou carregar um celular.\nÉ bem legal ver como a gente pode usar uma energia que vem do sol e não polui!\nAlguém já montou algum projetinho com placa solar na escola ou em casa, ou tem dicas de onde encontrar informações fáceis e seguras sobre isso? Queria compartilhar o que eu aprender com vocês."
    }
]